'''
При виконанні дз використовувати Git (робити комміти, працювати в develop гілці, для кожного завдання окрема feature/<назва_гілки> гілка з develop гілки, після завершення роботи над завданням - робити merge feature гілки в dev гілку, після виконання всіх завдань зробити merge develop в master)
1. Користувач вводить три цифри з клавіатури. Залежно від вибору користувача програма виводить на екран максимум із трьох, мінімум із трьох або середньоарифметичне трьох чисел.
2. Користувач вводить з клавіатури кількість метрів. Залежно від вибору користувача програма переводить метри милі, дюйми або ярди.
Надіслати посилання на github з проектом
'''
# Вводимо кількість метрів
meters = float(input("Введіть кількість метрів: "))


# Вибір одиниці для конвертації
print("Виберіть одиницю для конвертації:")
print("1 - Милі")
print("2 - Дюйми")
print("3 - Ярди")
choice = input("Ваш вибір (1/2/3): ")
# Вводимо три числа з клавіатури
num1 = float(input("Введіть перше число: "))
num2 = float(input("Введіть друге число: "))
num3 = float(input("Введіть третє число: "))

# Константи для конвертації
METERS_IN_MILE = 1609.34
METERS_IN_INCH = 0.0254
METERS_IN_YARD = 0.9144

# Переведення метрів і виведення результату
if choice == '1':
    print(f"{meters} метрів це {meters / METERS_IN_MILE} миль.")
elif choice == '2':
    print(f"{meters} метрів це {meters / METERS_IN_INCH} дюймів.")
elif choice == '3':
    print(f"{meters} метрів це {meters / METERS_IN_YARD} ярдів.")
else:
    print("Неправильний вибір. Будь ласка, виберіть 1, 2, або 3.")
# Користувач вибирає опцію
print("Виберіть опцію:")
print("1 - Вивести максимум із трьох чисел")
print("2 - Вивести мінімум із трьох чисел")
print("3 - Вивести середньоарифметичне трьох чисел")
choice = input("Ваш вибір (1/2/3): ")


# Обробка вибору користувача і виведення результату
if choice == '1':
    print(f"Максимум із трьох чисел: {max(num1, num2, num3)}")
elif choice == '2':
    print(f"Мінімум із трьох чисел: {min(num1, num2, num3)}")
elif choice == '3':
    average = (num1 + num2 + num3) / 3
    print(f"Середньоарифметичне трьох чисел: {average}")
else:
    print("Неправильний вибір. Будь ласка, виберіть 1, 2, або 3.")