'''
1. Користувач вводить рядок з клавіатури. Порахуйте кількість літер, цифр у рядку. Виведіть обидві кількості на екран. (використовувати цикл)
2. Користувач вводить з клавіатури рядок та символ для пошуку. Порахуйте скільки разів у рядку зустрічається потрібний символ. Отримане число виведіть на екран.
3. Користувач вводить з клавіатури рядок, слово для пошуку, слово для заміни. Зробіть у рядку заміну одного слова на інше. Отриманий рядок на екрані.
4. Дано рядок. (зробити зрізи)
- Спершу виведіть третій символ цього рядка.
- У другому рядку виведіть передостанній символ цього рядка.
- У третьому рядку виведіть перші п'ять символів цього рядка.
- У четвертому рядку виведіть весь рядок, крім двох останніх символів.
- У п'ятому рядку виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться з першого).
- У шостому рядку виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
- У сьомому рядку виведіть усі символи у зворотному порядку.
- У восьмому рядку виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
- У дев'ятому рядку виведіть довжину цього рядка.

Додатково:
Є певний текст. Реалізуйте наступну функціональність:
■ Змінити текст таким чином, щоб кожне речення починалися з великої літери;
■ Порахуйте скільки разів цифри зустрічаються у тексті;
■ Порахуйте скільки разів розділові знаки зустрічаються в тексті;
■ Порахуйте кількість знаків оклику в тексті.
'''

# 1.
# Запитуємо у користувача рядок
print("Програма порахує кількість літер, цифр у введеному рядку та виведе обидві кількості на екран.")
text = input("Введіть рядок з клавіатури: ")

# Ініціалізація лічильників
letters = 0
digits = 0

# Перебираємо кожен символ в рядку
for char in text:
    if char.isalpha():  # Перевіряємо, чи є символ літерою
        letters += 1
    elif char.isdigit():  # Перевіряємо, чи є символ цифрою
        digits += 1

# Виводимо результати
print(f"Введено рядок: {text}")
print(f"Довжина рядка: {len(text)}")
print(f"Кількість літер: {letters}")
print(f"Кількість цифр: {digits}")